XML/xml-request.formatted

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope
    soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"  
    xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <soap:Body>
  <fetchdata xmlns="http://192.168.8.32:8080/TestWS">
   <c-gensym3 xsi:type="xsd:string">/etc/motd</c-gensym3>
  </fetchdata>
 </soap:Body>
</soap:Envelope>
